In [1]:
import numpy as np
import pandas as pd

## query

In [2]:
#Query using df

df = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C': range(10, 15)})
df

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [3]:
#Query the columns of a DataFrame with a boolean expression
df.query('A > B')

   A  B   C
4  5  2  14

In [4]:
df.query('A==3')

   A  B   C
2  3  6  12

In [5]:
df[df['A']==3]

   A  B   C
2  3  6  12

In [12]:
#fetch the value from column B where value of column A==3
#df[df.A==3].B
#df[df.A==3]['B']
df[df.A==3][['B']]

   B
2  6

In [14]:
df.query('A==3').B

2    6
Name: B, dtype: int64

In [16]:
#fetch B and C where A==3
df.query('A==3')[['B','C']]

   B   C
2  6  12

In [18]:
df[df['A']==3][['B','C']]

   B   C
2  6  12

In [19]:
df

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [25]:
df[df.A.apply(lambda x: x==3)][['B','C']]

   B   C
2  6  12

In [29]:
def find(n):
    if n == 3:
        return True
    else:
        return False
df[df.A.apply(find)]

   A  B   C
2  3  6  12

In [30]:
df #if we want to do the addition of any two columns

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [31]:
df['A']+df['B']

0    11
1    10
2     9
3     8
4     7
dtype: int64

In [32]:
pd.eval('df.A+df.B')

0    11
1    10
2     9
3     8
4     7
dtype: int64

In [33]:
df.eval('A+C')

0    11
1    13
2    15
3    17
4    19
dtype: int64

# ---------Simple Data science Case study-------

In [37]:
df = pd.DataFrame({'name':['Ashwin','Sanjay','Smita','Vaibhav','Abhijeet','Mahadev','Supriya','Pallavi','Sumeet','Chidambar','Subhash'],
                  'place':['Pune','Satara','Sangli','Solapur','Kolhapur','Pune','Satara','Sangli','Solapur','Pune','Satara'],
                  'age':[42,20,25,36,28,24,45,25,21,19,45]})
df

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
2       Smita    Sangli   25
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [40]:
#How many records are there?
#records means no. rows
print('Total number of records are:',df.shape[0])

Total number of records are: 11

In [41]:
print('Total number of records are:',len(df))

Total number of records are: 11

In [42]:
# List out the names of employee
df.name

0        Ashwin
1        Sanjay
2         Smita
3       Vaibhav
4      Abhijeet
5       Mahadev
6       Supriya
7       Pallavi
8        Sumeet
9     Chidambar
10      Subhash
Name: name, dtype: object

In [44]:
print(list(df.name))

['Ashwin', 'Sanjay', 'Smita', 'Vaibhav', 'Abhijeet', 'Mahadev', 'Supriya', 'Pallavi', 'Sumeet', 'Chidambar', 'Subhash']

In [46]:
print(df.name.to_list())

['Ashwin', 'Sanjay', 'Smita', 'Vaibhav', 'Abhijeet', 'Mahadev', 'Supriya', 'Pallavi', 'Sumeet', 'Chidambar', 'Subhash']

In [48]:
print(dict(df.name))

{0: 'Ashwin', 1: 'Sanjay', 2: 'Smita', 3: 'Vaibhav', 4: 'Abhijeet', 5: 'Mahadev', 6: 'Supriya', 7: 'Pallavi', 8: 'Sumeet', 9: 'Chidambar', 10: 'Subhash'}

In [49]:
print(df.name.to_dict())

{0: 'Ashwin', 1: 'Sanjay', 2: 'Smita', 3: 'Vaibhav', 4: 'Abhijeet', 5: 'Mahadev', 6: 'Supriya', 7: 'Pallavi', 8: 'Sumeet', 9: 'Chidambar', 10: 'Subhash'}

In [50]:
#List out the names of columns
df.columns

Index(['name', 'place', 'age'], dtype='object')

In [51]:
# i want top 3 entries
df.head(3)

     name   place  age
0  Ashwin    Pune   42
1  Sanjay  Satara   20
2   Smita  Sangli   25

In [52]:
df[:3]

     name   place  age
0  Ashwin    Pune   42
1  Sanjay  Satara   20
2   Smita  Sangli   25

In [53]:
# i want last 3 entries
df.tail(3)

         name    place  age
8      Sumeet  Solapur   21
9   Chidambar     Pune   19
10    Subhash   Satara   45

In [57]:
# I want record of an employee whose age is 42
df[df.age==42]

     name place  age
0  Ashwin  Pune   42

In [62]:
# i want name of an emp who is from Kolhapur 
df[df.place=='Kolhapur'].name

4    Abhijeet
Name: name, dtype: object

In [65]:
#Count of Employee per place
#Return a Series containing counts of unique values.
df.place.value_counts()

Pune        3
Satara      3
Sangli      2
Solapur     2
Kolhapur    1
Name: place, dtype: int64

In [66]:
# List the unique cities/places
df.place.unique()

array(['Pune', 'Satara', 'Sangli', 'Solapur', 'Kolhapur'], dtype=object)

In [67]:
#Count the unique places
df.place.nunique()

5

In [68]:
#fetch records for Place Pune
df.query('place=="Pune"')

        name place  age
0     Ashwin  Pune   42
5    Mahadev  Pune   24
9  Chidambar  Pune   19

In [70]:
df.groupby('place').get_group('Pune')

        name place  age
0     Ashwin  Pune   42
5    Mahadev  Pune   24
9  Chidambar  Pune   19

In [71]:
#fetch name of emp. whose age is min
df.age.min()

19

In [73]:
df.query('age==19').name

9    Chidambar
Name: name, dtype: object

In [77]:
df[df.age == df.age.min()].name

9    Chidambar
Name: name, dtype: object

In [78]:
#fetch such records whose name length is>5
df[df.name.map(lambda x:len(x))>5]

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [82]:
df[df.name.apply(len)>5]

         name     place  age
0      Ashwin      Pune   42
1      Sanjay    Satara   20
3     Vaibhav   Solapur   36
4    Abhijeet  Kolhapur   28
5     Mahadev      Pune   24
6     Supriya    Satara   45
7     Pallavi    Sangli   25
8      Sumeet   Solapur   21
9   Chidambar      Pune   19
10    Subhash    Satara   45

In [83]:
#fetch the record whose name starts with 'M'
df[df.name.str.startswith('M')]

      name place  age
5  Mahadev  Pune   24

In [87]:
# fetch the name and place whose age is divisible by 4
df[df.age%4==0]

       name     place  age
1    Sanjay    Satara   20
3   Vaibhav   Solapur   36
4  Abhijeet  Kolhapur   28
5   Mahadev      Pune   24

In [ ]:
#convert places into int ex. Pune=12 Satara=11 likewise

In [ ]:

# I want the records of emp whose age is greater than 30
# I want the emp whose name starts with A
# i want the place of an emp whose name endswith a
# what is age of Akshay
# who is from place Satara
# i want record of emp whose age less than  or equal to 25
# list out the name and age of emp from Sangli location
# add a column with designation 
# find out is there any duplicate entry?
# find out the count of null/NaN values
# what is the age of Akshay?